* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA LOCAL
1 STOP-LOOP (L)  INIT <FALSE>
END-DEFINE

/* REPEAT UNTIL: O BLOCO DE CÓDIGO É EXECUTADO
/* ATÉ QUE A CONDIÇÃO SEJA VERDADEIRA

REPEAT 
    WRITE 'ESTOU NO LOOP'
    MOVE TRUE TO STOP-LOOP
    UNTIL STOP-LOOP = TRUE
END-REPEAT

END

