* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA LOCAL
1 VWEM VIEW OF EMPLOYEES
    2 FIRST-NAME /* COLUNAS
    2 CITY       /* COLUNAS
END-DEFINE

/* EMPLOYESS: TABELA/VIEW
/* VWEM: APELIDO DADO A TABELA

/* READ: LÊ TODOS OS REGISTROS
/* DA TABELA VWEM (EMPLOYESS)

/* DISPLAY: MOSTRA OS REGISTROS

READ VWEM
    DISPLAY VWEM
END-READ

END