* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA LOCAL
1 VWEM VIEW OF EMPLOYEES
    2 NAME
END-DEFINE

/* NAME É UM DESCRITOR

/* HISTOGRAM: MOSTRA O Nº DE OCORRENCIAS
/* DE CADA DESCRITOR

/* A VARIÁVEL DE SISTEMA *NUMBER CONTEM O
/* Nº DE REGISTROS DO BANCO DE DADOS

HISTOGRAM VWEM NAME STARTING FROM 'A' THRU 'C' 
    DISPLAY NAME *NUMBER
END-HISTOGRAM

END