* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA LOCAL
1 VWEM VIEW OF EMPLOYEES
    2 NAME
END-DEFINE

/* NAME É UM DESCRITOR

/* O FILTRO NO READ IRÁ BUSCAR OS
/* NOMES COMEÇANDO EM B E TERMINANDO
/* ANTES DE C

READ VWEM BY NAME = 'B' ENDING AT 'C'
    DISPLAY VWEM
END-READ

END
